tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mhaeuser/mhaeuser"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "romkatv/powerlevel10k"
tap "sidneys/homebrew"
tap "zegervdv/zathura"

# brews
brew "aria2"
brew "aspell"
brew "autoconf-archive"
brew "automake"
brew "boost"
brew "cabextract"
brew "gcc"
brew "fftw"
brew "iniparser"
brew "portaudio"
brew "cava"
brew "cdrtools"
brew "python@3.13"
brew "fd"
brew "fzf"
brew "git-lfs"
brew "pkgconf"
brew "hdf5"
brew "ncurses"
brew "htop"
brew "iperf3"
brew "libtool"
brew "macvim"
brew "make"
brew "meson"
brew "neofetch"
brew "neovim"
brew "node"
brew "pandoc"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "stow"
brew "unzip"
brew "uv"
brew "wimlib"
brew "xclip"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "qmk/qmk/qmk"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-poppler"

# casks
cask "alfred"
cask "alt-tab"
cask "battery-toolkit"
cask "ghostty"
cask "git-credential-manager"
cask "maccy"
cask "monitorcontrol"
cask "qlcolorcode"
cask "qlstephen"
cask "quicklook-json"
cask "raycast"
cask "timemachineeditor"
